uhnp/src/Catalogs/СтавкиНалоговМСФО/СтавкиНалоговМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтавкиНалоговМСФО</name>
  <attributes>
    <name>СтавкаПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗнаменательСтавкиАгента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСтавки</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/СтавкиНДСМСФО/СтавкиНДСМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиНДСМСФО</name>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНалоговМСФО</types>
    </type>
  </resources>
  <dimensions>
    <name>Актив</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/СтраныМира/СтраныМира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраныМира</name>
  <predefined>
    <items>
      <name>Россия</name>
      <description>РОССИЯ</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчастникЕАЭС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/СтавкиНалоговМСФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	Если Параметры.Свойство("Организация") Тогда
		Если ЗначениеЗаполнено(Параметры.Организация.СтранаРегистрации) Тогда
			Параметры.Отбор.Вставить("Страна", Параметры.Организация.СтранаРегистрации);
		Иначе
			Параметры.Отбор.Вставить("Страна", ОбщегоНазначенияПовтИспУХ.СтранаПоУмолчанию());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСтавкиРФ(Параметры = Неопределено) Экспорт
	
	Если Не УчетМСФОПовтИспУХ.ЕстьРСБУ() Тогда
		Возврат; //в ВЕ нет Перечисление.СтавкиНДС
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтавкиНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Перечисление.СтавкиНДС КАК СтавкиНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНалоговМСФО КАК СтавкиНалоговМСФО
	|		ПО СтавкиНДС.Ссылка = СтавкиНалоговМСФО.ИсточникСтавки
	|			И (СтавкиНалоговМСФО.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	|ГДЕ
	|	СтавкиНалоговМСФО.Ссылка ЕСТЬ NULL");
	ЗаменитьРФ(Запрос.Текст);
	
	СтавкаНДСПоУмолчанию = Неопределено;
	Период = ТекущаяДата();
	
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
		
		МодульУчетНДСУП = ОбщегоНазначения.ОбщийМодуль("УчетНДСУП");
		Попытка
			СтавкаНДСПоУмолчанию = МодульУчетНДСУП
				.СтавкаНДСПоУмолчанию(Неопределено, Период, Истина)
				.ПеречислениеСтавкаНДС;
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось определить ставку НДС по умолчанию для МСФО'"));
		КонецПопытки;
		
	Иначе 
		
		МодульУчетНДСКлиентСервер = ОбщегоНазначения.ОбщийМодуль("УчетНДСКлиентСервер");
		СтавкаНДСПоУмолчанию = МодульУчетНДСКлиентСервер.СтавкаНДСПоУмолчанию(Период, Истина);
	
	КонецЕсли;
	
	Страна = ОбщегоНазначенияПовтИспУХ.СтранаПоУмолчанию();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = СоздатьЭлемент();
		Объект.ИсточникСтавки 			= Выборка.Ссылка;
		Объект.Наименование 			= Выборка.Ссылка;
		Объект.Страна 					= Страна;
		Объект.СтавкаПоУмолчанию 		= (СтавкаНДСПоУмолчанию = Выборка.Ссылка);
		Объект.Ставка 					= ОбработкаТабличныхЧастейКлиентСерверУХ.СтавкаНДСЧислом(Выборка.Ссылка);
		Объект.ЗнаменательСтавкиАгента 	= 1;
		
		Объект.УстановитьНовыйКод();
		
		ОбновлениеИнформационнойБазыБМ.ЗаписатьОбъект(Объект);
		
	КонецЦикла; 

КонецПроцедуры

Функция ПредставлениеСтавки(Объект) Экспорт

	Если (Объект.ЗнаменательСтавкиАгента = 1) 
		Или (Объект.ЗнаменательСтавкиАгента = 0) Тогда
		Возврат Строка(Объект.Ставка) + "%";
	КонецЕсли;

	Возврат Строка(Объект.Ставка) + "/" + Объект.ЗнаменательСтавкиАгента;

КонецФункции

Функция СтавкаПоУмолчанию(Страна) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтавкиНалоговМСФО КАК т
	|ГДЕ
	|	т.Страна = &Страна
	|	И т.СтавкаПоУмолчанию
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.ПометкаУдаления");
	Запрос.УстановитьПараметр("Страна", Страна);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.СтавкиНалоговМСФО.ПустаяСсылка();
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().Получить(0).Ссылка;

КонецФункции

Функция СтавкиНДС(ОбъектУчета, Организация) Экспорт

	Запрос = Новый Запрос(ТекстЗапроса_СтавкиОбъектов(Неопределено, Неопределено));
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
	
	Возврат ОбщегоНазначенияКлиентСервер.СкопироватьСоответствие(
		Запрос.Выполнить().Выгрузить());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса_СтавкиОбъектов(НомераТаблиц = Неопределено, Параметры = Неопределено)
	
	Если НомераТаблиц <> Неопределено Тогда
		НомераТаблиц.Вставить("втПараметрыУчетаОбъектов", НомераТаблиц.Количество());
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ключ,
	|	ЕСТЬNULL(Ставка1.Страна, ЕСТЬNULL(Ставка2.Страна, ПоУмолчанию.Страна)) КАК Значение
	|ПОМЕСТИТЬ втПараметрыУчетаОбъектов
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаРегистрации
	|		ПО (СтранаРегистрации.Ссылка В
	|				(ВЫБРАТЬ
	|					ВЫБОР
	|						КОГДА о.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|							ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|						ИНАЧЕ о.СтранаРегистрации
	|					КОНЕЦ
	|				ИЗ
	|					Справочник.Организации КАК о
	|				ГДЕ
	|					о.Ссылка = &Организация))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСМСФО КАК Ставка1
	|		ПО т.Ссылка = Ставка1.Актив
	|			И (СтранаРегистрации.Ссылка = Ставка1.Страна)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСМСФО КАК Ставка2
	|		ПО т.Ссылка.Родитель = Ставка2.Актив
	|			И (СтранаРегистрации.Ссылка = Ставка2.Страна)
	|			И (Ставка1.Актив ЕСТЬ NULL)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНалоговМСФО КАК ПоУмолчанию
	|		ПО (ПоУмолчанию.СтавкаПоУмолчанию)
	|			И (СтранаРегистрации.Ссылка = ПоУмолчанию.Страна)
	|ГДЕ
	|	&Условие";
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Первые1", Истина) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1", "");
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Поместить", Ложь) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ втПараметрыУчетаОбъектов", "");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отбор", Истина) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", "т.Ссылка В (&ОбъектУчета)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", "ИСТИНА");
	КонецЕсли;
	
	ИмяТаблицы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяТаблицы");
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Номенклатура", ИмяТаблицы);
	КонецЕсли;

	ЗаменитьРФ(ТекстЗапроса);
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ЗаменитьРФ(ТекстЗапроса)

	Если ОбщегоНазначенияПовтИспУХ.ЕстьРСБУ() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтраныМира.Россия", "СтраныМира.ПустаяСсылка");

КонецПроцедуры

#КонецОбласти

#КонецЕсли
